In [2]:
import pandas as pd

# Series

In [3]:
data = [1, 2, 3, 4, 5]
s = pd.DataFrame(data)

In [4]:
s

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
# editando o index como desejar

index = ['Linha' + str(i) for i in range(5)]

In [6]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [7]:
s = pd.Series(data = data, index = index)

In [8]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [9]:
# criação de um dicionário # i + 1, até que ele chegue ate cinco.
data = {'Linha' + str(i): i + 1 for i in range(5)}

In [10]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [11]:
# o pandas aceita o dicionario, porém o index passar ser a chave do dicionário
s = pd.Series(data)

In [12]:
#index é a chave do dicionário 
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [13]:
# somando valores ao dataframe s
s1 = s + 2

In [14]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

# Dataframe

## DataFrame personalizado

In [41]:
# lista de listas 
data = [[1, 2], [3, 4], [5, 6]]

In [42]:
df1 = pd.DataFrame (data = data)

In [43]:
df1

   0  1
0  1  2
1  3  4
2  5  6

In [44]:
index = ['Linha' + str(i) for i in range(3)]

In [45]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1
Linha0  1  2
Linha1  3  4
Linha2  5  6

In [46]:
# nomeando as colunas
columns = ['Coluna' + str(i) for i in range(2)]

In [47]:
columns

['Coluna0', 'Coluna1']

In [49]:
# criando dataframe totalmente personalizando 
df1 = pd.DataFrame(data = data, index = index, columns = columns )

In [50]:
df1

        Coluna0  Coluna1
Linha0        1        2
Linha1        3        4
Linha2        5        6

In [53]:
#lista de tuplas
data = [(1, 2), (3, 4), (5, 6)]
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Coluna0  Coluna1
Linha0        1        2
Linha1        3        4
Linha2        5        6

In [56]:
df1

        Coluna0  Coluna1
Linha0        1        2
Linha1        3        4
Linha2        5        6

In [62]:
df1[df1 > '0'] = 'A'
df1

       Coluna0 Coluna1
Linha0       A       A
Linha1       A       A
Linha2       A       A

In [64]:
df3[df3 > '0'] = 'B'
df3

       Coluna0 Coluna1
Linha0       B       B
Linha1       B       B
Linha2       B       B

In [66]:
#união de dois dataframes
df4 = pd.concat([df1, df3])
df4

       Coluna0 Coluna1
Linha0       A       A
Linha1       A       A
Linha2       A       A
Linha0       B       B
Linha1       B       B
Linha2       B       B

In [68]:
# com o 'axis = 1' os dataframes são organizados lado a lado
df5 = pd.concat([df1, df3], axis = 1)
df5

       Coluna0 Coluna1 Coluna0 Coluna1
Linha0       A       A       B       B
Linha1       A       A       B       B
Linha2       A       A       B       B

In [69]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [70]:
# cada tupla  fica em uma linha 
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [71]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [72]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4

Percurso até aqui: 
+ Como selecionar uma variável do dataframe (por exemplo, dados['Tipo'] ou dados.Tipo)
+ Que um dataframe é composto de vários Series
+ Como eliminar duplicatas (pelo método drop_duplicates())
+ Como redefinir o index de um dataframe e series (atributo index)
+ Como concatenar dataframes (lembrando do axis)
+ Como criar novos dataframes baseados em estruturas de dados Python (lista, dicionários ou tuples)

In [75]:


numeros = [i for i in range(11)]
letras = [chr(i + 65) for i in range(11)]
nome_coluna = ['N']

df = pd.DataFrame(data = numeros, index = letras, columns = nome_coluna)
df

    N
A   0
B   1
C   2
D   3
E   4
F   5
G   6
H   7
I   8
J   9
K  10

In [82]:
print(chr(i + 65) for i in range(11))

<generator object <genexpr> at 0x0000022889FB57B0>

In [85]:
# o if funciona como um filtro e o i no inicio é utilizado quando se quer criar um tipo de dado: lista, tupla, dicionário 
selecao = df['N'].isin([i for i in range(11) if i % 2 == 0])
df = df[selecao]
df

    N
A   0
C   2
E   4
G   6
I   8
K  10

# Exportando os dados